RemoveFilter Method
 Removes a filter from the view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public void RemoveFilter(
	ElementId filterElementId
)
Visual Basic
Public Sub RemoveFilter ( _
	filterElementId As ElementId _
)
Visual C++
public:
void RemoveFilter(
	ElementId^ filterElementId
)
Parameters
filterElementId
Type: Autodesk.Revit.DBElementId
 ElementId of the filter.
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsArgumentException |  Filter is not applied to the view. -or- ElementId is not associated with a FilterElement.
Autodesk.Revit.ExceptionsArgumentNullException |  A non-optional argument was null
Autodesk.Revit.ExceptionsInvalidOperationException |  The element "this View" does not belong to a project document. -or- The view type does not support Visibility/Graphics Overriddes.
See Also
View Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →